{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [3, 3, 3, 32], "name": "conv2d_1/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_1/bias", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [3, 3, 32, 32], "name": "conv2d_2/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv2d_2/bias", "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [3, 3, 32, 64], "name": "conv2d_3/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_3/bias", "dtype": "float32"}]}, {"paths": ["group4-shard1of2", "group4-shard2of2"], "weights": [{"shape": [18496, 64], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [64], "name": "dense_1/bias", "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"shape": [64, 1], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [1], "name": "dense_2/bias", "dtype": "float32"}]}], "modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_3", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_2", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_5"}}]}, "keras_version": "2.1.4", "training_config": {"loss": "binary_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "amsgrad": false, "epsilon": 1e-07, "beta_2": 0.9990000128746033}}}, "backend": "tensorflow"}}