{"modelTopology": null, "weightsManifest": [{"weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [8192, 256]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [256]}], "paths": ["group1-shard1of3", "group1-shard2of3", "group1-shard3of3"]}, {"weights": [{"name": "dense_2/kernel", "dtype": "float32", "shape": [256, 1]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [1]}], "paths": ["group2-shard1of1"]}]}